export function treatDescricao(str: string): string {
    const chars = [
        '�','職','ﾇ','ﾕ','縊','ﾁ','ﾃ','ﾊ','ﾄ','ﾍ','ｰ','兤','ﾓ','鈬','・','ﾔ','輟','ｴ','ﾉ','ｺ','匤','軋','ﾂ','黌','ﾌ','ﾚ','侒','﨎','疝','侔','‡','Ƒ','•','€','¡','䰃','偐','!','#','Ъ','Г','З','Й','Б','У','Н','Ф','К','Х','В','ƒ','Ґ','・','','當','疵','騁','疊','匇','疽','ﾑ','Т','И','Ј','Ѓ','�','Є','░','┤','','','‰','Щ','А','Ĺ','Ȋ','Ô','├','Ë','Ü','ﾈ','ﾒ','Б','Ќ','Љ','Ђ','Љ','Ò','Μ','İ','±','ｲ'
    ];
    let result = str;
    chars.forEach(char => {
        result = result.split(char).join('');
    });
    return result;
}

export function treatGtin(str: string): string {
    return str
        .replace(/[A-Z]/g, '')
        .replace(/[a-z]/g, '')
        .replace(/[ÁÉÍÓÚáéíóúÂÊÔâêôÀàÜüÇçÑñÃÕõäëïöüÿÄËÏÖÜŸåÅæÆœŒ]/g, '')
        .replace(/[.\| ,!@/\-\$%¨&*()+=§:;?¿�^~{}´`_º\[\]¬]/g, '');
}